ProgessBase/Documents/ПереоценкаВалютныхСтатейМеждународный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПереоценкаВалютныхСтатейМеждународный</Name>
			<Comment>(Упр)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Международный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОтнесенияКурсовыхРазниц</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/AccountingRegisters/Международный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Международный</Name>
			<Comment>(Упр)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Международный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПервичныйНомерСтроки</Name>
					<Comment>Необходим для переноса затрат</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПравилоПереносаДт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаСоответствияСчетовБУиМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_НомерСтрокиПравилаПереносаДт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПравилоПереносаКт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаСоответствияСчетовБУиМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_НомерСтрокиПравилаПереносаКт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/СчетаСОсобымПорядкомПереоценкиМеждународный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СчетаСОсобымПорядкомПереоценкиМеждународный</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетОтнесенияКурсовыхРазниц</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Documents/ПереоценкаВалютныхСтатейМеждународный/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

Перем мВалютаРегламентированногоУчета Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецЕсли

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МеждународныйОстатки.Счет,
	               |	МеждународныйОстатки.Субконто1,
	               |	МеждународныйОстатки.Субконто2,
	               |	МеждународныйОстатки.Субконто3,
	               |	СУММА(МеждународныйОстатки.ВалютнаяСуммаОстатокДт) КАК ВалютнаяСуммаОстатокДт,
	               |	СУММА(МеждународныйОстатки.ВалютнаяСуммаОстатокКт) КАК ВалютнаяСуммаОстатокКт,
	               |	СУММА(МеждународныйОстатки.СуммаОстатокДт) КАК СуммаОстатокДт,
	               |	СУММА(МеждународныйОстатки.СуммаОстатокКт) КАК СуммаОстатокКт,
	               |	МеждународныйОстатки.Валюта
	               |ИЗ
	               |	РегистрБухгалтерии.Международный.Остатки(&ПериодКонец, Счет.Валютный = &Истина, , Организация = &Организация) КАК МеждународныйОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	МеждународныйОстатки.Счет,
	               |	МеждународныйОстатки.Субконто1,
	               |	МеждународныйОстатки.Субконто2,
	               |	МеждународныйОстатки.Субконто3,
	               |	МеждународныйОстатки.Валюта";
	
	Запрос.УстановитьПараметр("ПериодКонец", Новый Граница(КонецМесяца(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Истина", Истина);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.Валюта) Тогда
			Продолжить;
		КонецЕсли;

		СуммаЕсть = Выборка.СуммаОстатокДт - Выборка.СуммаОстатокКт;
		
		Попытка
			Если глЗначениеПеременной("ВалютаМеждународногоУчета") = мВалютаРегламентированногоУчета Тогда
				Если Выборка.Валюта = мВалютаРегламентированногоУчета Тогда
					Множитель = 1;
				Иначе
					Множитель = МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.Валюта, Дата).Курс / МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.Валюта, Дата).Кратность;
				КонецЕсли;
			Иначе
				Если Выборка.Валюта = мВалютаРегламентированногоУчета Тогда
					Множитель = 1/(МодульВалютногоУчета.ПолучитьКурсВалюты(глЗначениеПеременной("ВалютаМеждународногоУчета"), Дата).Курс / МодульВалютногоУчета.ПолучитьКурсВалюты(глЗначениеПеременной("ВалютаМеждународногоУчета"), Дата).Кратность);
				Иначе
					Множитель = (МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.Валюта, Дата).Курс / МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.Валюта, Дата).Кратность) / (МодульВалютногоУчета.ПолучитьКурсВалюты(глЗначениеПеременной("ВалютаМеждународногоУчета"), Дата).Курс / МодульВалютногоУчета.ПолучитьКурсВалюты(глЗначениеПеременной("ВалютаМеждународногоУчета"), Дата).Кратность);
				КонецЕсли;
			КонецЕсли;
		Исключение
			Сообщить("Обнаружен нулевой курс валюты!");
			Отказ = Истина;
			Прервать;
		КонецПопытки;
		
		СуммаДолжноБыть = (Выборка.ВалютнаяСуммаОстатокДт - Выборка.ВалютнаяСуммаОстатокКт) * Множитель;
		СуммаРазница = Окр((СуммаДолжноБыть - СуммаЕсть),2);
		
		Если СуммаРазница <> 0 Тогда
			// is ЯннуровВФ нач 20141028
			//// регистр Международный 
			//Движение = Движения.Международный.Добавить();
			//Движение.Период = Дата;
			//Движение.Организация = Организация;
			// is ЯннуровВФ кон 20141028
			
			СрезСведений = РегистрыСведений.СчетаСОсобымПорядкомПереоценкиМеждународный.ПолучитьПоследнее(Дата, Новый Структура("Счет", Выборка.Счет));
			// is ЯннуровВФ нач 20141028
			Если СрезСведений.Исключить Тогда 
				Продолжить;
			КонецЕсли;
			
			// регистр Международный 
			Движение = Движения.Международный.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			// is ЯннуровВФ кон 20141028
			
			Если СуммаРазница > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(СрезСведений.СчетОтнесенияКурсовыхРазниц) Тогда
					// is ЯннуровВФ нач 20140602 ЗР-0И-001326
					//Движение.СчетКт = ПланыСчетов.Международный.ПрочиеОперационныеДоходы;
					//Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ВидыДоходовИРасходов] = СтатьяОтнесенияКурсовыхРазниц;
					Движение.СчетКт = ПланыСчетов.Международный.ПрочиеВнереализационныеДоходы;
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ПрочиеДоходыИРасходы] = СтатьяОтнесенияКурсовыхРазниц;
					// is ЯннуровВФ кон 20140602 
				Иначе
					Движение.СчетКт = СрезСведений.СчетОтнесенияКурсовыхРазниц;
					Для Ном = 1 по Движение.СчетКт.ВидыСубконто.Количество() Цикл
						//>>180716 Степанов 52764 Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[Ном-1].ВидСубконто] = СрезСведений["Субконто" + Ном];
						БухгалтерскийУчет.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, Ном, СрезСведений["Субконто" + Ном]);
					КонецЦикла;
				КонецЕсли;
				
				Движение.СчетДт = Выборка.Счет;
				Движение.ВалютаДт = Выборка.Валюта;
				Для Ном = 1 по Движение.СчетДт.ВидыСубконто.Количество() Цикл
					//>>180716 Степанов 52764 Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[Ном-1].ВидСубконто] = Выборка["Субконто" + Ном];
					БухгалтерскийУчет.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, Ном, Выборка["Субконто" + Ном]);
				КонецЦикла;
				
			Иначе
				
				СуммаРазница = - СуммаРазница;  // сумма в проводке должна быть всегда положительной
				Если НЕ ЗначениеЗаполнено(СрезСведений.СчетОтнесенияКурсовыхРазниц) Тогда
					// is ЯннуровВФ нач 20140602 ЗР-0И-001326
					//Движение.СчетДт = ПланыСчетов.Международный.ПрочиеОперационныеРасходы;
					//Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ВидыДоходовИРасходов] = СтатьяОтнесенияКурсовыхРазниц;
					Движение.СчетДт = ПланыСчетов.Международный.ПрочиеВнереализационныеРасходы;
					Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ПрочиеДоходыИРасходы] = СтатьяОтнесенияКурсовыхРазниц;
					// is ЯннуровВФ кон 20140602
				Иначе
					Движение.СчетДт = СрезСведений.СчетОтнесенияКурсовыхРазниц;
					Для Ном = 1 по Движение.СчетДт.ВидыСубконто.Количество() Цикл
						//>>180716 Степанов 52764 Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[Ном-1].ВидСубконто] = СрезСведений["Субконто" + Ном];
						БухгалтерскийУчет.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, Ном, СрезСведений["Субконто" + Ном]);
					КонецЦикла;
				КонецЕсли;

				Движение.СчетКт = Выборка.Счет;
				Движение.ВалютаКт = Выборка.Валюта;
				Для Ном = 1 по Движение.СчетКт.ВидыСубконто.Количество() Цикл
					//>>180716 Степанов 52764 Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[Ном-1].ВидСубконто] = Выборка["Субконто" + Ном];
					БухгалтерскийУчет.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, Ном, Выборка["Субконто" + Ном]);
				КонецЦикла;
			КонецЕсли;
			
			Движение.Сумма = СуммаРазница;
			Движение.Содержание = "Переоценка валютных статей";
			Движение.НомерЖурнала = "Рег";
		КонецЕсли;
	КонецЦикла;

	Движения.Международный.Записать();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;


	 
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
